Repository: Nastormo/MSU_LinuxDev2020
Catalog: 13_PatchInstall/bin_search.*.po
Languages: ru

source: Usage: bin_search [OPTION] Number guessing mini game. Options: -r, --roman enable roman number -h, --help print help information It is a guessing mini game where you choose a number from 1 to 100 and the program finds it whis bin search.
ru: Использование: bin_search [ОПЦИИ] Мини игра по угадыванию чисел. Опции: -r, --roman римское представление чисел -h, --help печать информации о приложении Это мини игра где вам необходимо выбрать число от 1 до 100, а программа угадает его при помощи бин поиска.

source: Choose number from 1 to 100
ru: Выберите число от 1 до 100

source: Choose number from %s to %s
ru: Выберите число от %s до %s

source: Your number greater than %d?:
ru: Ваше число больше чем %d?:

source: Your number greater than %s?:
ru: Ваше число больше чем %s?:

source: Yes
ru: Да

source: Y
ru: Д

source: yes
ru: да

source: y
ru: д

source: No
ru: Нет

source: N
ru: Н

source: no
ru: нет

source: n
ru: н

source: Selected value: %d
ru: Выбранное число: %d

source: Selected value: %s
ru: Выбранное число: %s
